espressif/binutils-esp32ulp/gas/config/tc-esp32ulp_esp32.c

#include "tc-esp32ulp_esp32.h"
#ifdef TC_ESP32ULP

#include "tc-esp32ulp.h"
#include "opcode/esp32ulp.h"
#include "opcode/esp32ulp_esp32.h"

static const char *op = ".__operator";

INSTR_T esp32ulp_gen_wait_esp32(void)
{
	unsigned int local_op = OP_CMD_WAIT(0);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alur_esp32(int dst, int src1, int src2, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_r - dst=%i, src1=%i, src2=%i, op = %i\n", dst, src1, src2, operation);
	unsigned int local_op = I_ALUR(dst, src1, src2, operation);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alui_esp32(int dst, int src1, Expr_Node* addr, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_i - dst=%i, src1=%i, operation = %i, type=%i, op_value = %i\n", dst, src1, operation, (int)addr->type, (int)addr->value.op_value);
	int imm_val = EXPR_VALUE(addr);
	unsigned int local_op = I_ALUI(dst, src1, imm_val, operation);
	int rel = BFD_RELOC_ESP32ULP_ALUI;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_gen_jump_r_esp32(int dst_reg, int cond)
{
	unsigned int local_op = I_JUMP_RI(dst_reg, 0, cond, 1);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_jump_i_esp32(Expr_Node* addr, int cond)
{
	int val;
	int rel = 0;

	rel = BFD_RELOC_ESP32ULP_16_IMM;

	val = EXPR_VALUE(addr);
	if ((val % 4) != 0) error("%s","Esp32Ulp is 32-bit addressing processor. Relative jump value must be divided by 4.");
	unsigned int local_op = I_JUMP_RI(0, val>>2, cond, 0);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

// INSTR_T esp32ulp_gen_jump_relr_esp32(Expr_Node* addr, int judge, int thresh)
// {
// 	int rel = 0;

// 	rel = BFD_RELOC_ESP32ULP_JUMPR;

// 	int val = EXPR_VALUE(addr);
// 	unsigned int local_op = I_JUMP_RELR(thresh, judge, (unsigned int)val>>2);

// 	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
// }


INSTR_T esp32ulp_cmd_jump_rels_esp32(Expr_Node* step, Expr_Node* thresh, int cond)
{
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);

	if ((cond == BRCOND_EQ) || (cond == BRCOND_GT)) // EQ == 3, GT = 4
	{
		// Conditions for multiple instructions
		unsigned int walk_cond = 0;
		unsigned int result_cond = 0;

		if (cond == BRCOND_EQ) // EQ
		{
			//	Jumps   Next, threshold, LT
			//	Jumps   step, threshold, LE
			//Next : something
			walk_cond = 0;
			result_cond = 2;
		}
		if (cond == BRCOND_GT) // GT
		{
			//	Jumps   Next,  threshold, LE
			//	Jumps   step, threshold,  GE
			//Next : something

			walk_cond = 2;
			result_cond = 1;
		}
		// Step over next jumps
		unsigned int local_walk = I_JUMP_RELS(thresh_val, walk_cond, (NEXT_INSTRUCTION_STEP*2) >> 2);
		// In case of back jump, we have to add additional jumps instruction to the step value
		if (step_val < 0) step_val = step_val - 4;

		// Step to the target instruction
		unsigned int local_result = I_JUMP_RELS(thresh_val, result_cond, step_val >> 2);

		// Main instruction that makes jump
		INSTR_T result = conscode(gencode(local_result),
			conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32ULP_JUMPR_STEP),
			Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32ULP_JUMPS_THRESH)
			)
			);
		// Additional instructiion for add additional check of the condition
		INSTR_T walk1 = conscode(gencode(local_walk),
			conctcode(Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32ULP_JUMPS_THRESH), NULL
			)
			);

		// We have to find last instruction in walk1 and connect
		// result to them
		INSTR_T last_inst = walk1->next;
		while (last_inst->next)
		{
			last_inst = last_inst->next;
		}
		walk1->mult = 0;
		result->mult = 1;
		last_inst->next = result;
		return walk1;
	}
	else // LE, LT, GE
	{
		unsigned int local_op = I_JUMP_RELS(thresh_val, cond, step_val >> 2);

		INSTR_T result = conscode(gencode(local_op),
			conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32ULP_JUMPR_STEP),
			Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32ULP_JUMPS_THRESH)
			)
			);
		
		return result;
	}
}

INSTR_T esp32ulp_cmd_reg_rd_esp32(Expr_Node* addr, Expr_Node* high, Expr_Node* low)
{
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_RD_REG(addr_val, low_val, high_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_REG_RW_LOW))));
}

INSTR_T esp32ulp_cmd_reg_wr_esp32(Expr_Node* addr, Expr_Node* high, Expr_Node* low, Expr_Node* data)
{
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int data_val = EXPR_VALUE(data);

	if (addr_val > DR_REG_MAX_DIRECT)
	{
		if ((addr_val >= DR_REG_RTCCNTL_BASE) && (addr_val < DR_REG_IO_MUX_BASE))
		{
			addr_val = (addr_val - DR_REG_RTCCNTL_BASE)/4;
		} else {
			error("%s","Register address out of range. Must be 0..0x3ff, or in range of 0x3ff48000 .. 0x3ff49000.");
		}
	}
	unsigned int local_op = I_WR_REG(addr_val, low_val, high_val, data_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32ULP_REG_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_REG_RW_LOW)))));
}

INSTR_T esp32ulp_cmd_i2c_rd_esp32(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel)
{
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);

	unsigned int local_op = I_I2C_RW(addr_val, 0, low_val, high_val, i2c_sel_val, OPCODE_I2C_RD);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_I2C_RW_LOW)))));
}

INSTR_T esp32ulp_cmd_i2c_wr_esp32(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel, Expr_Node* data)
{
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);
	unsigned int data_val = EXPR_VALUE(data);

