espressif/binutils-esp32ulp/gas/config/tc-esp32ulp_esp32.c
INSTR_T Expr_Node_Gen_Reloc_esp32(Expr_Node *head, int parent_reloc);

INSTR_T Expr_Node_Gen_Reloc_esp32(Expr_Node * head, int parent_reloc)
{
	/* Top level reloction expression generator VDSP style.
	If the relocation is just by itself, generate one item
	else generate this convoluted expression.  */

	INSTR_T note = NULL_CODE;
	INSTR_T note1 = NULL_CODE;
	int pcrel = 1;  /* Is the parent reloc pcrelative?
					This calculation here and HOWTO should match.  */

	if (parent_reloc)
	{
		/*  If it's 32 bit quantity then 16bit code needs to be added.  */
		int value = 0;

		if (head->type == Expr_Node_Constant)
		{
			/* If note1 is not null code, we have to generate a right
			aligned value for the constant. Otherwise the reloc is
			a part of the basic command and the yacc file
			generates this.  */
			value = head->value.i_value;
		}
		switch (parent_reloc)
		{
			/*  Some relocations will need to allocate extra words.  */
		case BFD_RELOC_ESP32ULP_16_IMM:
		case BFD_RELOC_ESP32ULP_JUMPR:
		case BFD_RELOC_ESP32ULP_16_LOAD:
		case BFD_RELOC_ESP32ULP_WR_MEM:
		case BFD_RELOC_ESP32ULP_ALUI:
		case BFD_RELOC_ESP32ULP_WAIT:
		case BFD_RELOC_ESP32ULP_TSENS_DELAY:
		case BFD_RELOC_ESP32ULP_WAKE:
		case BFD_RELOC_ESP32ULP_SLEEP:
		case BFD_RELOC_ESP32ULP_ADC_CYCLE:
		case BFD_RELOC_ESP32ULP_ADC_SEL:
		case BFD_RELOC_ESP32ULP_ADC_MUX:
		case BFD_RELOC_ESP32ULP_STAGE:
		case BFD_RELOC_ESP32ULP_JUMPR_STEP:
		case BFD_RELOC_ESP32ULP_JUMPR_THRESH:
		case BFD_RELOC_ESP32ULP_JUMPR_THRESHREL:
		case BFD_RELOC_ESP32ULP_JUMPS_THRESH:
		case BFD_RELOC_ESP32ULP_REG_RW_HIGH:
		case BFD_RELOC_ESP32ULP_REG_RW_LOW:
		case BFD_RELOC_ESP32ULP_REG_RW_ADDR:
		case BFD_RELOC_ESP32ULP_REG_RW_DATA:
		case BFD_RELOC_ESP32ULP_I2C_RW_HIGH:
		case BFD_RELOC_ESP32ULP_I2C_RW_LOW:
		case BFD_RELOC_ESP32ULP_I2C_RW_ADDR:
		case BFD_RELOC_ESP32ULP_I2C_RW_DATA:
		case BFD_RELOC_ESP32ULP_I2C_RW_SEL:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		case BFD_RELOC_16:
		case BFD_RELOC_24:
		case BFD_RELOC_32:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		default:
			note1 = NULL_CODE;
		}
	}
	if (head->type == Expr_Node_Constant)
		note = note1;
	else if (head->type == Expr_Node_Reloc)
	{
		note = note_reloc1(gencode(0), head->value.s_value, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else if (head->type == Expr_Node_Binop
		&& (head->value.op_value == Expr_Op_Type_Add
		|| head->value.op_value == Expr_Op_Type_Sub)
		&& head->Left_Child->type == Expr_Node_Reloc
		&& head->Right_Child->type == Expr_Node_Constant)
	{
		int val = head->Right_Child->value.i_value;
		if (head->value.op_value == Expr_Op_Type_Sub)
			val = -val;
		note = conscode(note_reloc2(gencode(0), head->Left_Child->value.s_value,
			parent_reloc, val, 0),
			NULL_CODE);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else
	{
		/* Call the recursive function.  */
		note = note_reloc1(gencode(0), op, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
		note = conctcode(Expr_Node_Gen_Reloc_R(head), note);
	}
	return note;
}


#endif // TC_ESP32ULP